#include "Stdafx.h"
using namespace std;
/*
Создать очередь, информационными полями которого являются: компьютер и объем его оперативной памяти.
Удалить из очереди сведения о компьютере, которые были введены первыми. Организовать просмотр данных
очереди и вычислить общий объем памяти компьютеров, записанных в очереди
*/
void low()
{
	system("cls");
	cout << "\nLow task level:\n";
}